---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.IPipeFittingAndAccessoryPressureDropServer.IsApplicable(Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropData)
source: html/33054e4c-b294-fd0e-5da6-cd314882f1e5.htm
---
# Autodesk.Revit.DB.Plumbing.IPipeFittingAndAccessoryPressureDropServer.IsApplicable Method

Check if the server is applicable for the pipe fitting or pipe accessory.

## Syntax (C#)
```csharp
bool IsApplicable(
	PipeFittingAndAccessoryPressureDropData data
)
```

## Parameters
- **data** (`Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropData`) - The input data of the calculation.